{"data":{"site":{"siteMetadata":{"title":"Borealis Digital Studio blog","company":"Borealis Digital Studio"}},"markdownRemark":{"id":"a321be57-2ea3-5215-a4e6-d18a6d69392b","excerpt":"Today the Borealis Branding guidelines are available in PDF format. It’s ideal to print out and to read it on physical paper but it’s suboptimal in the reality…","html":"<p>Today the Borealis Branding guidelines are available in PDF format. It’s ideal to print out and to read it on physical paper but it’s suboptimal in the reality of today where everyone is trying to read them on a computer screen. It’s hard to navigate the 128 pages if you are looking for one specific item like the Borealis blue hex colour value.</p>\n<p>A second hassle is to find the latest version of the branding guidelines, new employees don’t know where they are and some employees don’t even know they exist. If however, you get the guidelines, you are never sure that you have the latest version. If there is a newer version available than what you currently have, you are probably too lazy to update it.  </p>\n<p>Another inconvenience is the lack of access to resources. When you read about the guidelines on how to use a logo, you don’t know where to download that specific logo. It happens quite often that someone downloads the Borealis logo from an unofficial source. This leads to the misuse of logos.</p>\n<p>To summarize the accessibility problems with the Borealis branding guidelines: Searchability, versioning and access to resources.</p>\n<h2>Proposed solution</h2>\n<p>An online digital version of the branding guidelines in the form of a web application. Right now only a <a href=\"https://sketch.cloud/s/v1D28/a/1ZZRwb/play\">static prototype</a> has been developed to showcase the possible capabilities. <a href=\"https://sketch.cloud/s/v1D28/a/1ZZRwb/play\"><strong>please visit the link before reading further</strong></a></p>\n<p>Only parts of the guidelines have been prototyped to give an impression of which direction we want to take for the solution. When validated the rest of the guidelines can be prototyped.</p>\n<h3>Navigation</h3>\n<p>The prototype has a side navigation bar including the main items of the Borealis branding guidelines. It can easily be extended and the nature of the design keeps everything scanable. </p>\n<p><a href=\"https://sketch.cloud/s/v1D28/a/bddyVZ/play\">Navigation preview</a></p>\n<h3>Header</h3>\n<p>The header contains a general search bar where anything within the guidelines can be found via a simple search query. Right next to the search bar there is a version select. Here you can select the version of the design guide. Ideal for testing alpha/beta updates or to go back to previous versions to see the updates. Another nice to have is to see the change logs per version.</p>\n<p><a href=\"https://sketch.cloud/s/v1D28/a/qkkyJe/play\">Header preview</a> </p>\n<p><em>The search capabilities are not yet prototyped</em></p>\n<h3>Specific developers features</h3>\n<p>Using the guidelines as a developer is a different experience since we can integrate the <a href=\"https://github.com/borealisgroup/borealis-js\">libraries</a> that follow the guidelines. A toggle should enable developer features. </p>\n<p><em>So far this behaviour hasn’t been prototyped</em></p>\n<h3>Scanable and layered information</h3>\n<p>People on the web <a href=\"https://www.nngroup.com/articles/how-users-read-on-the-web/\">rarely read text word by word</a>. They scan the page and pick out whatever they need. Following this reasoning we made some information layered. Most of the pages contain boxes with the folowing structure: Image, Title and expandable arrow icon. When the user clicks on the title or arrow it should expand and show more information like a description.</p>\n<p><a href=\"https://sketch.cloud/s/v1D28/a/5eJmVp/play\">Expandable box preview</a></p>\n<p><em>So far the behaviour of opening and closing are not yet prototyped</em></p>\n<h3>Logo page</h3>\n<p>On this page a user can configure the borealis logo and download it as a SVG file. For developers a code block from the logo library should appear.</p>\n<p>Whenever you configure the logo in a way that is violating the guidelines, for example only selecting the Aurora icon with a solid background. Then a warning ⚠️ should appear explaining that this specific configuration is a violation of the guidelines and downloading the logo should become impossible.</p>\n<p>Underneath the logo configuration there is a section “dont’s” which explains the way the logo <strong>shouldn’t</strong> be used. Since this information is so close to the place where users will get their logo, it will naturaly lead to less misuse of the logo.</p>\n<p>Other information about the logo from the guidelines are listed underneath the “dont’s”.</p>\n<p><a href=\"https://sketch.cloud/s/v1D28/a/1ZZRwb/play\">Logo page preview</a></p>\n<p><em>The warning hasn’t been prototyped yet</em></p>\n<p><em>Not all the dont’s and information boxes are listed to save time</em></p>\n<h3>Colours page</h3>\n<p>Here users can find all the colours mentioned in the borealis guidelines with a description for every category. Every colour has a name with a hex value that can easily be copied to the clipboard by clicking on it. Shades are also documented and the name of the shaded colour informs how much it deviates from the base colour. </p>\n<h4>added colour values</h4>\n<p>We added for every primary colour one darker shade level since we saw in some applications like a side navigation sub menu that darker shades are preferable.</p>\n<img src=\"https://osmium-storybook.s3.eu-central-1.amazonaws.com/images/myborealis-navbar.png\" alt=\"MyBorealis navigation bar\" width=\"200\">\n<p>We also propose to add extra shades to the “additional indicator” colours for the UI elements displayed underneath which is used in some applications</p>\n<img src=\"https://osmium-storybook.s3.eu-central-1.amazonaws.com/images/alert-boxes.png\" alt=\"alert boxes showing shaded colours\" width=\"400\">\n<p><a href=\"https://sketch.cloud/s/v1D28/a/3vzn7r/play\">Colours page preview</a></p>\n<p><em>Only the primary colors are shown as an example since it takes to much time to prototype all the colours, coding it would be way more time efficient</em></p>\n<h3>Typography page</h3>\n<p>The only typographic base values defined in the guidelines are font families. In our <a href=\"https://github.com/borealisgroup/borealis-js/blob/master/packages/theme/src/brands/borealis.json\">theming library</a> we defined other values like font weight, line heights and font sizes.</p>\n<p>Those typographic values are used for the configuration at the top of the page. An extra idea would be to add some preset values for paragraphs, titles (h1, h2, h3, …), links etc so that we also create consistency for those elements.</p>\n<p>The user can input their own text and copy the style via the “copy button” to the clipboard. When pasted in a program like Outlook it should keep the defined style if the correct fonts are set up.</p>\n<p>The real benefit here is for developers, for them we could create a CSS code block which is linked to the defined values. Completed integrated with the <a href=\"https://github.com/borealisgroup/borealis-js/blob/master/packages/theme/src/brands/borealis.json\">theming library</a>. </p>\n<p><a href=\"https://sketch.cloud/s/v1D28/a/1ZnbK4/play\">Typography page preview</a></p>\n<h3>Icon page</h3>\n<p>The current guidelines only describe how we should design custom icons and it has a couple of examples. But not enough to display a full icon package. So far within Borealis we haven’t defined any icon package that should be used accross digital projects. We propose to custom make or buy a guideline complaint icon package.</p>\n<p>To show an <strong>example</strong> what it <strong>could</strong> look like, we copied the <a href=\"https://ant.design/components/icon/\">icon package from Ant Design</a>. When clicking on a icon, it should download the SVG or if you are a developer it should also give you the option to copy the code from a library.</p>\n<p><a href=\"https://ant.design/components/icon/\">Icon page preview</a></p>\n<h3>Headline system page</h3>\n<p>A direct copy of the information described in the guidelines. Any extra information can be expanded from it’s respective box.</p>\n<p><a href=\"https://sketch.cloud/s/v1D28/a/8m2lmY/play\">Headline system page preview</a></p>\n<h3>Should branding guidelines be public or not?</h3>\n<p>Many companies already put their branding guidelines publicly online. For example:</p>\n<ul>\n<li><a href=\"https://www.carbondesignsystem.com/\">IBM</a></li>\n<li><a href=\"https://www.lightningdesignsystem.com/\">Salesforce</a></li>\n<li><a href=\"https://www.starbucks.com/static/reference/styleguide/\">Starbucks</a></li>\n<li><a href=\"https://issuu.com/logobr/docs/adobe_brand_guidelines\">Adobe</a></li>\n<li><a href=\"https://www.audi.com/ci/en/renewed-brand.html\">Audi</a></li>\n<li><a href=\"https://www.dropbox.com/branding/\">Dropbox</a></li>\n<li><a href=\"https://en.facebookbrand.com/\">Facebook</a></li>\n<li><a href=\"http://ggw-prototype.goalgorilla.com/\">Greenpeace</a></li>\n<li><a href=\"http://walmartlabs.github.io/web-style-guide/\">Walmart</a></li>\n<li><a href=\"http://styleguides.io/examples.html\">…</a></li>\n</ul>\n<p>Making your branding guidelines public could bring the following benefits:</p>\n<ul>\n<li>It ensures that anyone who needs access to the guidelines can just access it with the click of a link. No need for login/registration pages or user management.</li>\n<li>\n<p>It makes your branding guidelines crowable for search engines like Google or Bing. When done right the following situation could happen: </p>\n<ol>\n<li>Jane Doe needs the Borealis logo but she doesn’t know that Borealis Branding guidelines exist</li>\n<li>When Jane doesn’t know where to find something she does what every smart person does, she goes to Google and searches: “Borealis Logo”</li>\n<li>The first link from the search result is a link from the official Borealis Branding Guideline logo page</li>\n<li>Jane clicks on that link because it’s exactly what she needs, she can configure/download the Borealis logo following the guidelines and immidiately knows how she shouldn’t use it. </li>\n<li>Jane now also knows that Borealis Branding guidelines exists and she bookmarks it for later use.</li>\n</ol>\n</li>\n<li>Making beautiful branding guidelines that are easy to use and accesible convinces naturally to anyone that we are taking design at Borealis very seriously. Potential hires could be more eager to take a job at Borealis because of this attitude. You can even find <a href=\"http://styleguides.io/examples.html\">online listings of profesional branding guidelines</a>.</li>\n</ul>\n<p>A reason to not do it is that you don’t want that the competition can look into our guidelines and copy them. If someone is copying our guidelines for their own use, it means that we are doing something right. So take it as a compliment. I couldn’t find any argument on google supporting this statement, we just have to think twice about what we put public so that it doesn’t hurt our bussiness.</p>","frontmatter":{"title":"Improving accessibility branding guidelines","date":"June 13, 2019","author":"Lennert Van Sever","authorAvatar":"https://avatars1.githubusercontent.com/u/23064517?s=400&u=3eef2f2dbadc082c1d74a76aab1a66b4b7ed30a9&v=4","authorEmail":"lennert.vansever@borealisgroup.com","authorSocial":"https://github.com/lennertVanSever","description":"Improving the accessibility of the Borealis branding guidelines through a web application"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/digital-borealis-branding-guidelines/digital-borealis-branding-guidelines/","previous":{"fields":{"slug":"/setting-up-a-gatsby-blog/setting-up-a-gatsby-blog/"},"frontmatter":{"title":"Setting up a gatsby blog"}},"next":null}}